Revit 2024 API
BuiltInFailures.MEPSupportFailures.CannotMatchInstanceSizeToHostError Property
 The instance of [Symbol] cannot be re-sized to match the host.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId CannotMatchInstanceSizeToHostError { get; }
Visual Basic
Public Shared ReadOnly Property CannotMatchInstanceSizeToHostError As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ CannotMatchInstanceSizeToHostError {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.MEPSupportFailures Class
Autodesk.Revit.DB Namespace